{
  "backend/main.mo": "Main Motoko canister implementing access-controlled user profiles, quizzes, articles, and blob storage with authorization checks and migration support.",
  "backend/migration.mo": "Migration module converting old actor state to new format by introducing a persistent article store while preserving existing maps.",
  "feature_evidence.json": "Feature evidence report detailing a frontend change related to article display reliability with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files including styles, components, hooks, quiz logic, and infrastructure utilities.",
  "frontend/.env.example": "Example environment configuration showing translation API options and backend canister ID setup for build-time or runtime usage.",
  "frontend/index.css": "Global Tailwind-based theme defining cyber-bunker OKLCH color variables, dark mode, base styles, and safe-area inset support.",
  "frontend/index.html": "App HTML entry point with enforced dark mode and pre-bootstrap script loading runtime env.json before React initializes.",
  "frontend/public/env.json": "Runtime environment file containing a placeholder backend canister ID.",
  "frontend/src/App.tsx": "Main React application managing authentication, view routing, diagnostics, quiz flow, and study article navigation.",
  "frontend/src/components/AdminStatusPanel.tsx": "Empty placeholder component file for an admin status panel.",
  "frontend/src/components/AdminTokenReauthDialog.tsx": "Empty placeholder component file for an admin token reauthentication dialog.",
  "frontend/src/components/AppHeaderBrand.tsx": "Brand header component displaying app title and metadata with a themed icon.",
  "frontend/src/components/BuildIdentityFooter.tsx": "Footer component showing build version, timestamp, and deployment ID for diagnostics.",
  "frontend/src/components/DeploymentDiagnosticsPanel.tsx": "Diagnostics panel running health checks, environment checks, error reporting, and providing sharing and publishing tools.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity with reactive UI states and error handling.",
  "frontend/src/components/PendingUpdateBanner.tsx": "Placeholder component that renders nothing.",
  "frontend/src/components/ProfileSetup.tsx": "Profile setup form allowing users to submit their name and save it to the backend.",
  "frontend/src/config/index.ts": "Creates configured backend actors, resolves canister IDs, and initializes agents for local or production use.",
  "frontend/src/config/translation.ts": "Translation utility calling a configurable API to translate text between languages.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useBackupRestore.ts": "Provides backup and restore functions using actor state export/import with validation and UI status flags.",
  "frontend/src/hooks/useExportAllQuestions.ts": "Exports all quizzes’ questions and block names using the backend actor with error reporting.",
  "frontend/src/hooks/useGenerateArticle.ts": "Generates an article from a question via the backend actor and validates the returned content.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, logging in, clearing identity, and tracking login status.",
  "frontend/src/hooks/usePendingUpdate.ts": "Detects when a new build is available by comparing stored and current build IDs and exposes a flag and method to mark the update as seen.",
  "frontend/src/hooks/usePressHold.ts": "Implements press-and-hold detection using pointer and keyboard events, returning pressed state and event handlers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, quizzes, question data, and counts via an actor API with diagnostics.",
  "frontend/src/hooks/useQuestionTranslation.ts": "Provides translation utilities with caching, deduped requests, error handling, and translation state tracking.",
  "frontend/src/hooks/useQuizRecovery.ts": "Adds functionality to copy all questions from one quiz to another with error handling and query invalidation.",
  "frontend/src/index.css": "Imports global theme styles from the root index.css file.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/quiz/adaptiveScheduler.ts": "Implements an adaptive question scheduler with first‑pass randomization, spaced repeats, and mastery tracking.",
  "frontend/src/quiz/BackupRestorePanel.tsx": "UI panel enabling quiz data export to JSON and restoration from a selected file, with confirmation dialog and status feedback.",
  "frontend/src/quiz/blockUtils.ts": "Utility functions for dividing questions into 100‑question blocks and labeling or slicing them.",
  "frontend/src/quiz/draftStorage.ts": "Saves, loads, and clears quiz drafts in localStorage with versioning and question serialization.",
  "frontend/src/quiz/imageUtils.ts": "Helpers for validating JPEGs, converting files to bytes, generating preview URLs, and creating ExternalBlobs.",
  "frontend/src/quiz/pdfImport/PdfImportPreview.tsx": "Empty placeholder file.",
  "frontend/src/quiz/pdfImport/pdfImportTypes.ts": "Empty placeholder file.",
  "frontend/src/quiz/pdfImport/pdfTextExtractor.ts": "Empty placeholder file.",
  "frontend/src/quiz/pdfImport/questionExtractionParser.ts": "Empty placeholder file.",
  "frontend/src/quiz/PreGameQuestionCountView.tsx": "Renders a selector for choosing the number of quiz questions before starting, including loading and insufficient-questions states.",
  "frontend/src/quiz/PreQuizSummaryView.tsx": "Displays a summary of selected block and question count before starting a quiz, with validation and navigation buttons.",
  "frontend/src/quiz/QuestionImagePicker.tsx": "Allows attaching, previewing, uploading, and removing JPG images for a question with size checks and progress feedback.",
  "frontend/src/quiz/QuizEditor.tsx": "Large editor component for creating, editing, validating, restoring, and exporting quiz questions with extensive UI controls and state handling.",
  "frontend/src/quiz/quizFlowDiagnostics.ts": "Development helpers for logging quiz flow transitions and actions based on a localStorage flag.",
  "frontend/src/quiz/QuizGameplay.tsx": "Controls the full quiz flow including block selection, question count, summary, adaptive scheduling, translation, and answering logic.",
  "frontend/src/quiz/QuizResults.tsx": "Shows final quiz score, correct/incorrect counts, and provides actions to replay, review mistakes, or return to editing.",
  "frontend/src/quiz/QuizScoreBar.tsx": "Fixed bottom bar displaying running score of correct versus answered questions.",
  "frontend/src/quiz/randomSubset.ts": "Generates randomized subsets of question indices using Fisher‑Yates shuffle.",
  "frontend/src/quiz/sessionTypes.ts": "Type definitions for tracking question performance and session state.",
  "frontend/src/quiz/StudyArticleView.tsx": "Generates and displays a study article for a question with loading, error handling, scrolling, and escape‑key navigation.",
  "frontend/src/quiz/TroubleshootingPanel.tsx": "UI panel showing all quizzes, their question counts, and warnings when the current quiz is empty.",
  "frontend/src/quiz/types.ts": "Re‑exports Question and QuizId types from the backend.",
  "frontend/src/quiz/validation.ts": "Validates quiz questions for required content, answer counts, and correct‑answer indices.",
  "frontend/src/quiz/WrongAnswersReview.tsx": "Displays a scrollable list of wrong answers with optional study actions and Escape-to-exit support.",
  "frontend/src/quiz/wrongAnswerTypes.ts": "Defines the WrongAnswerEntry type for wrong‑answer review features.",
  "frontend/src/types/env.d.ts": "Type declarations for Vite environment variables and optional window‑injected env metadata.",
  "frontend/src/utils/actorConnectionInfo.ts": "Resolves backend connection info including host, network, and canister ID using sync or async resolution paths.",
  "frontend/src/utils/buildStamp.ts": "Generates and caches build metadata using build-time and runtime env values with a stable build identifier.",
  "frontend/src/utils/canisterIdResolution.ts": "Resolves the backend canister ID from multiple prioritized sources with tracking and detailed error reporting.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Collects, stores, and formats diagnostic errors with connection metadata for deployment troubleshooting.",
  "frontend/src/utils/formatPublishChecklist.ts": "Builds a detailed text checklist for publishing, including build info, canister resolution, and step-by-step instructions.",
  "frontend/src/utils/liveReadiness.ts": "Evaluates deployment readiness based on canister ID resolution and backend health check results.",
  "frontend/src/utils/quizExport.ts": "Exports quiz data to a timestamped JSON file and triggers a browser download.",
  "frontend/src/utils/refreshToLatestBuild.ts": "Performs a hard refresh by clearing app storage, unregistering service workers, clearing caches, and reloading with cache-busting.",
  "frontend/src/utils/runtimeEnvStatus.ts": "Inspects window.__ENV__ and /env.json accessibility to report configuration status and troubleshooting steps.",
  "frontend/src/utils/shareLiveVerificationInfo.ts": "Generates a detailed text report combining build info, env status, canister resolution, network config, and health checks.",
  "frontend/src/utils/stateSnapshotJson.ts": "Serializes and deserializes StateSnapshot objects, handling ExternalBlob URL conversion and basic validation.",
  "frontend/src/utils/stoppedCanisterDetection.ts": "Detects IC0508 stopped-canister errors, extracts canister IDs, formats messages, and provides recovery steps.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters across query, hash, and session storage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining themes, colors, typography, animations, and container settings.",
  "project_state.json": "Project metadata describing the need to replace placeholder study articles with generated and persisted real content."
}