{
  "backend/main.mo": "Motoko backend implementing access-controlled user profiles, quiz storage, and question retrieval with support for articles and blob-based images.",
  "feature_evidence.json": "Feature evidence report listing publishing and diagnostics features with associated files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files covering styles, components, hooks, quiz logic, PDF import, and configuration.",
  "frontend/.env.example": "Example environment configuration showing translation API settings and how to supply backend canister IDs for builds and runtime.",
  "frontend/index.css": "Tailwind-based global stylesheet defining cyber-bunker OKLCH color tokens for light/dark modes plus safe-area support.",
  "frontend/index.html": "Main HTML template that forces dark mode and loads runtime environment variables from env.json before bootstrapping React.",
  "frontend/public/env.json": "Placeholder runtime configuration file containing a placeholder backend canister ID with instructions to be replaced during publish.",
  "frontend/PUBLISHING.md": "Publishing guide detailing how to deploy via the Caffeine editor and how to verify runtime configuration using in-app diagnostics.",
  "frontend/src/App.tsx": "Main app component handling authentication, actor initialization, health checks, and rendering UI states like profile setup and diagnostics.",
  "frontend/src/components/AdminStatusPanel.tsx": "Empty placeholder file for an admin status panel component.",
  "frontend/src/components/AdminTokenReauthDialog.tsx": "Empty placeholder file for an admin token reauthentication dialog component.",
  "frontend/src/components/AppHeaderBrand.tsx": "Renders the app header brand with an icon and static title/subtitle text.",
  "frontend/src/components/BuildIdentityFooter.tsx": "Displays build metadata including version, timestamp, and deployment ID in the footer.",
  "frontend/src/components/DeploymentDiagnosticsPanel.tsx": "Diagnostics panel for checking health, runtime env, connection info, and publish readiness with various expandable sections.",
  "frontend/src/components/LoginButton.tsx": "Provides login/logout button using Internet Identity with status handling and query cache clearing.",
  "frontend/src/components/ManualBackendCanisterIdOverridePanel.tsx": "UI to manually enter, validate, save, or clear a backend canister ID override and trigger retries.",
  "frontend/src/components/PendingUpdateBanner.tsx": "Banner that notifies users about available updates and offers a guarded refresh action.",
  "frontend/src/components/ProfileSetup.tsx": "Simple form for collecting and saving the user's name during initial setup.",
  "frontend/src/config/index.ts": "Creates and configures backend actors with IDL loading, agent setup, and canister ID resolution.",
  "frontend/src/config/translation.ts": "Implements a translation helper using a configurable API endpoint with MyMemory as fallback.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBackupRestore.ts": "Provides export and restore of full backend state via actor calls with JSON serialization and validation.",
  "frontend/src/hooks/useExportAllQuestions.ts": "Exports all quizzes with their questions and block names by iterating through quiz IDs using the actor.",
  "frontend/src/hooks/useGenerateArticle.ts": "Generates an article from question text, then normalizes and validates its content using a React Query hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login, stored identity loading, and auth client configuration with a React context.",
  "frontend/src/hooks/usePendingUpdate.ts": "Detects if a new build is available by comparing stored and current build IDs and provides a mark-as-seen helper.",
  "frontend/src/hooks/usePressHold.ts": "Implements press-and-hold detection with pointer and keyboard events, returning state and event handlers.",
  "frontend/src/hooks/useQueries.ts": "Provides multiple React Query hooks that call actor methods to fetch or mutate user profiles, quizzes, counts, and questions with error capture and conditional enabling.",
  "frontend/src/hooks/useQuestionTranslation.ts": "Implements a translation hook with caching, deduped requests, and error handling for translating question text.",
  "frontend/src/hooks/useQuizRecovery.ts": "Offers a function to copy all questions from one quiz to another and invalidates related queries, with loading and error state.",
  "frontend/src/hooks/useSingleRefreshAttempt.ts": "Creates a guarded refresh mechanism ensuring only one refresh-to-latest-build attempt runs per session.",
  "frontend/src/index.css": "Imports the global theme stylesheet.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/quiz/adaptiveScheduler.ts": "Implements an adaptive question scheduler with first‑pass randomization, spaced repeats, and mastery tracking.",
  "frontend/src/quiz/BackupRestorePanel.tsx": "UI component for exporting all quiz data to JSON and restoring from a selected backup file with confirmation flow.",
  "frontend/src/quiz/blockUtils.ts": "Helpers for computing 100‑question blocks, ranges, labels, and extracting block‑specific questions.",
  "frontend/src/quiz/draftStorage.ts": "Manages saving, loading, and clearing quiz drafts in localStorage with versioned serialization.",
  "frontend/src/quiz/imageUtils.ts": "Utilities for JPEG validation, file-to-bytes conversion, preview URLs, and ExternalBlob creation.",
  "frontend/src/quiz/pdfImport/PdfImportPreview.tsx": "Empty placeholder file for PDF import preview component.",
  "frontend/src/quiz/pdfImport/pdfImportTypes.ts": "Empty placeholder for PDF import type definitions.",
  "frontend/src/quiz/pdfImport/pdfTextExtractor.ts": "Empty placeholder for PDF text extraction logic.",
  "frontend/src/quiz/pdfImport/questionExtractionParser.ts": "Empty placeholder for parsing extracted PDF text into questions.",
  "frontend/src/quiz/PreGameQuestionCountView.tsx": "Lets users choose how many questions to practice before starting a quiz, with loading and validation states.",
  "frontend/src/quiz/PreQuizSummaryView.tsx": "Shows a summary of selected block and question count before quiz start, with validation and navigation options.",
  "frontend/src/quiz/QuestionImagePicker.tsx": "Component for attaching, uploading, previewing, and removing JPEG images for quiz questions.",
  "frontend/src/quiz/QuizEditor.tsx": "Full quiz editing interface handling question management, recovery, validation, image uploads, and draft saving.",
  "frontend/src/quiz/quizFlowDiagnostics.ts": "Provides optional diagnostic logging for quiz flow transitions and actions using a localStorage flag.",
  "frontend/src/quiz/QuizGameplay.tsx": "Runs the quiz flow including block selection, question sequencing, adaptive scheduling, answering, and translation support.",
  "frontend/src/quiz/QuizResults.tsx": "Displays final quiz score and provides actions to replay, review wrong answers, or return to editing.",
  "frontend/src/quiz/QuizScoreBar.tsx": "Fixed bottom bar showing running tally of correct and answered questions.",
  "frontend/src/quiz/randomSubset.ts": "Creates randomized subsets of indices using Fisher‑Yates shuffle with size clamping.",
  "frontend/src/quiz/sessionTypes.ts": "Defines interfaces for tracking per‑question performance and overall session state.",
  "frontend/src/quiz/StudyArticleView.tsx": "View for reading an article tied to a question, with back navigation and scrollable content.",
  "frontend/src/quiz/TroubleshootingPanel.tsx": "Collapsible panel listing quizzes and question counts for debugging quiz data issues.",
  "frontend/src/quiz/types.ts": "Re‑exports Question and QuizId types from backend.",
  "frontend/src/quiz/validation.ts": "Validates quiz questions, checking content, answer counts, answer text, and correct answer index.",
  "frontend/src/quiz/WrongAnswersReview.tsx": "React component showing missed questions with back navigation and Escape-key support.",
  "frontend/src/quiz/wrongAnswerTypes.ts": "Defines WrongAnswerEntry structure for wrong‑answer review data.",
  "frontend/src/types/env.d.ts": "Type definitions for environment variables and window runtime metadata.",
  "frontend/src/utils/actorConnectionInfo.ts": "Resolves backend canister connection info, determining host, network, and resolution metadata.",
  "frontend/src/utils/buildStamp.ts": "Retrieves build/version metadata prioritizing runtime env, and logs formatted build info.",
  "frontend/src/utils/canisterIdResolution.ts": "Resolves the backend canister ID using manual overrides, runtime env.json, or Vite env vars, with detailed error handling and placeholder detection.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Collects, stores, and formats deployment-related errors with metadata to aid troubleshooting, including a full diagnostic report generator.",
  "frontend/src/utils/formatPublishChecklist.ts": "Generates a detailed plain‑text publish checklist including build info, canister resolution details, and step‑by‑step publishing instructions.",
  "frontend/src/utils/liveReadiness.ts": "Evaluates whether the app is ready for live use based on canister resolution and backend health checks, returning a structured readiness status.",
  "frontend/src/utils/manualBackendCanisterOverride.ts": "Handles manual backend canister ID overrides via URL or localStorage with validation utilities and active override resolution.",
  "frontend/src/utils/quizExport.ts": "Provides utilities to export quiz data as JSON, generate timestamped filenames, and trigger browser downloads.",
  "frontend/src/utils/refreshToLatestBuild.ts": "Implements a hard-refresh workflow that clears app storage, unregisters service workers, wipes caches, marks the current build as seen, and reloads with cache-busting while capturing diagnostics on failure.",
  "frontend/src/utils/runtimeEnvReload.ts": "Fetches /env.json with cache-busting, updates runtime environment globals, handles missing/placeholder values, and returns a structured reload result.",
  "frontend/src/utils/runtimeEnvStatus.ts": "Inspects window.__ENV__ and load status markers to produce a detailed environment status with messages and troubleshooting guidance.",
  "frontend/src/utils/shareLiveVerificationInfo.ts": "Generates a multi-section plain‑text report containing build data, deployment URL, canister resolution info, runtime env status, and health‑check results.",
  "frontend/src/utils/stateSnapshotJson.ts": "Serializes and deserializes StateSnapshot objects to JSON-safe form, handling ExternalBlob URLs and validating structure.",
  "frontend/src/utils/stoppedCanisterDetection.ts": "Detects stopped‑canister errors (IC0508), extracts canister IDs, and provides user messages and recovery steps.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, store/retrieve them in sessionStorage, and manage hash-based query cleanup.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, fonts, container settings, animations, and plugin integrations.",
  "project_state.json": "Defines the project's state metadata, features, and deployment notes for the current build process.",
  "unknown.txt": "Contains instructions for generating study articles and managing stored article content with conditional creation."
}