{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles and quiz storage with query and update methods for profiles and questions.",
  "feature_evidence.json": "Feature evidence report mapping two features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing styling, components, hooks, quiz logic, and utilities.",
  "frontend/.env.example": "Example environment config showing translation API URL and how to provide backend canister IDs via build-time or runtime env.json.",
  "frontend/index.css": "Global Tailwind CSS theme with cyber‑bunker OKLCH colors, dark mode variables, and mobile safe-area handling.",
  "frontend/index.html": "HTML entry with pre-bootstrap script loading env.json into window.__ENV__ and starting the React app.",
  "frontend/public/env.json": "Runtime environment file containing an empty CANISTER_ID_BACKEND placeholder.",
  "frontend/src/App.tsx": "Main React app handling authentication, profile loading, quiz flow state, diagnostics, build info, and stopped-canister detection.",
  "frontend/src/components/AdminStatusPanel.tsx": "Empty placeholder component file.",
  "frontend/src/components/AdminTokenReauthDialog.tsx": "Empty placeholder component file.",
  "frontend/src/components/BuildIdentityFooter.tsx": "Footer component showing build version, timestamp, and deployment ID from buildStamp.",
  "frontend/src/components/DeploymentDiagnosticsPanel.tsx": "Diagnostics panel component that displays errors, health checks, runtime environment info, and publishing tools with auto-refresh and actions.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and error handling.",
  "frontend/src/components/ProfileSetup.tsx": "User onboarding form to save a display name via backend mutation.",
  "frontend/src/config/index.ts": "Creates configured backend actors, loads IDL dynamically, and exposes connection info utilities.",
  "frontend/src/config/translation.ts": "Translation helper using a configurable API endpoint with a MyMemory fallback.",
  "frontend/src/hooks/useActor.ts": "React hook that initializes and caches a backend actor based on identity and invalidates dependent queries.",
  "frontend/src/hooks/useBackupRestore.ts": "Hook for exporting and restoring full backend state with JSON serialization and validation.",
  "frontend/src/hooks/useExportAllQuestions.ts": "Hook to export all quizzes, questions, and block names while logging and continuing on errors.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity provider and hook managing login, stored identities, and status tracking.",
  "frontend/src/hooks/usePressHold.ts": "Provides a hook that tracks press-and-hold interactions across pointer and keyboard events and returns pressed state with handlers.",
  "frontend/src/hooks/useQueries.ts": "Wraps React Query calls for fetching and mutating quiz data via an actor, including profiles, quizzes, counts, and questions.",
  "frontend/src/hooks/useQuestionTranslation.ts": "Manages text translation with caching, deduped requests, error handling, and translation state.",
  "frontend/src/hooks/useQuizRecovery.ts": "Provides a function to copy questions from one quiz to another with status and error tracking, invalidating relevant queries.",
  "frontend/src/index.css": "Imports the global theme stylesheet.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers and renders the root component.",
  "frontend/src/quiz/adaptiveScheduler.ts": "Implements an adaptive question scheduler with randomized first pass, repeat logic, mastery tracking, and spacing rules.",
  "frontend/src/quiz/BackupRestorePanel.tsx": "UI panel for exporting quiz data to a JSON file and restoring from a selected backup with confirmation and status handling.",
  "frontend/src/quiz/blockUtils.ts": "Provides utilities for dividing questions into 100-question blocks and generating labels and ranges.",
  "frontend/src/quiz/draftStorage.ts": "Manages saving, loading, and clearing quiz drafts in localStorage with versioning and serialization utilities.",
  "frontend/src/quiz/imageUtils.ts": "Utilities for validating JPEG files, converting files to blobs, generating preview URLs, and creating ExternalBlob objects.",
  "frontend/src/quiz/pdfImport/PdfImportPreview.tsx": "Empty placeholder file for PDF import preview component.",
  "frontend/src/quiz/pdfImport/pdfImportTypes.ts": "Empty placeholder for PDF import type definitions.",
  "frontend/src/quiz/pdfImport/pdfTextExtractor.ts": "Empty placeholder for PDF text extraction logic.",
  "frontend/src/quiz/pdfImport/questionExtractionParser.ts": "Empty placeholder for parsing extracted PDF text into questions.",
  "frontend/src/quiz/PreGameQuestionCountView.tsx": "UI for selecting a question count before starting a quiz, with loading, validation, and slider controls.",
  "frontend/src/quiz/PreQuizSummaryView.tsx": "Displays a summary of selected quiz settings and validates question counts before the quiz starts.",
  "frontend/src/quiz/QuestionImagePicker.tsx": "Image upload component for questions, handling JPEG validation, progress, preview, and removal.",
  "frontend/src/quiz/QuizEditor.tsx": "Main quiz editor managing question editing, recovery, export, validation, and image attachments.",
  "frontend/src/quiz/quizFlowDiagnostics.ts": "Provides optional diagnostics logging for quiz flow transitions and actions, toggleable via localStorage.",
  "frontend/src/quiz/QuizGameplay.tsx": "Runs quiz gameplay flow including block selection, question selection, adaptive scheduling, answering, and translation.",
  "frontend/src/quiz/QuizResults.tsx": "Displays quiz completion results with score breakdown and actions to replay or review wrong answers.",
  "frontend/src/quiz/randomSubset.ts": "Creates randomized subsets of question indices using Fisher-Yates shuffling.",
  "frontend/src/quiz/sessionTypes.ts": "Defines performance and session state types for quiz tracking.",
  "frontend/src/quiz/TroubleshootingPanel.tsx": "Panel showing quiz data diagnostics like quiz list, question counts, and warnings for empty quizzes.",
  "frontend/src/quiz/types.ts": "Re-exports Question and QuizId types from the backend.",
  "frontend/src/quiz/validation.ts": "Validates quiz questions, ensuring required content, answer rules, and correct answer selection.",
  "frontend/src/quiz/WrongAnswersReview.tsx": "Shows a scrollable list of incorrectly answered questions with a back action and Escape key support.",
  "frontend/src/quiz/wrongAnswerTypes.ts": "Defines types for tracking wrong-answer review entries.",
  "frontend/src/types/env.d.ts": "Type definitions for environment variables and window-level injected config.",
  "frontend/src/utils/actorConnectionInfo.ts": "Resolves backend connection info including host, canister ID, network, and resolution metadata.",
  "frontend/src/utils/buildStamp.ts": "Generates build metadata including timestamp, version, environment, and a stable deployment ID.",
  "frontend/src/utils/canisterIdResolution.ts": "Resolves backend canister ID from multiple sources with detailed source tracking and error reporting.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Collects, stores, and formats deployment-related errors with metadata and provides a formatted diagnostics report.",
  "frontend/src/utils/formatPublishChecklist.ts": "Generates a plain-text checklist containing build info, canister resolution details, and publishing steps for deployment.",
  "frontend/src/utils/liveReadiness.ts": "Evaluates whether the app is ready for live use based on canister ID resolution and backend health check results.",
  "frontend/src/utils/quizExport.ts": "Provides helpers for exporting quiz data to JSON, generating filenames, and triggering browser downloads.",
  "frontend/src/utils/refreshToLatestBuild.ts": "Performs a hard refresh by clearing storage, unregistering service workers, clearing caches, and reloading with cache-busting.",
  "frontend/src/utils/runtimeEnvStatus.ts": "Inspects runtime env.json loading and CANISTER_ID_BACKEND presence and returns troubleshooting guidance.",
  "frontend/src/utils/shareLiveVerificationInfo.ts": "Formats a plain-text summary of build, canister, and health check info for live verification sharing.",
  "frontend/src/utils/stateSnapshotJson.ts": "Handles JSON-safe serialization and deserialization of full state snapshots, including ExternalBlob URL handling and validation.",
  "frontend/src/utils/stoppedCanisterDetection.ts": "Parses errors to detect IC0508 stopped-canister rejections, extract canister IDs, and provide messages and recovery steps.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, storing them in sessionStorage, and cleaning them from hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, shadows, and utilities, and enabling plugins like typography and container queries.",
  "project_state.json": "Describes the project’s current state, features, and pending requests for build/version accuracy and live deployment readiness."
}