{
  "backend/main.mo": "Main Motoko actor handling user profiles, access control, and quiz management with per-user quiz sets, questions, and block names.",
  "backend/migration.mo": "No-op state migration module mapping old actor state to the new layout without transformation.",
  "feature_evidence.json": "Feature evidence report listing implemented quiz-editor and gameplay features with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all frontend files in the project.",
  "frontend/.env.example": "Example environment variables for configuring translation API endpoints.",
  "frontend/index.css": "Global Tailwind-based OKLCH theme defining colors and CSS variables for light and dark modes.",
  "frontend/index.html": "Base HTML file mounting the React application’s root element and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component managing authentication, profile setup, navigation, and quiz session flow.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity with query cache clearing and error recovery.",
  "frontend/src/components/ProfileSetup.tsx": "Renders a name input form and saves the user profile before calling onComplete.",
  "frontend/src/config/translation.ts": "Defines a translation API wrapper using MyMemory and exposes translateText for German→English translation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout methods, and loads/stores identity via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, quizzes, question counts, and question blocks via the actor.",
  "frontend/src/hooks/useQuestionTranslation.ts": "Caches and fetches German→English translations for question text with loading/error state.",
  "frontend/src/hooks/useQuizRecovery.ts": "Provides a method to copy all questions from one quiz to another and invalidates related queries.",
  "frontend/src/index.css": "Imports the global stylesheet wrapper.",
  "frontend/src/main.tsx": "Bootstraps the app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/quiz/adaptiveScheduler.ts": "Implements an adaptive question scheduler with randomized ordering and repeat logic based on performance.",
  "frontend/src/quiz/blockUtils.ts": "Utility functions for managing 100-question blocks, ranges, labels, and block-based slicing.",
  "frontend/src/quiz/pdfImport/PdfImportPreview.tsx": "Empty placeholder file for PDF import preview UI.",
  "frontend/src/quiz/pdfImport/pdfImportTypes.ts": "Empty placeholder file for PDF import type definitions.",
  "frontend/src/quiz/pdfImport/pdfTextExtractor.ts": "Empty placeholder file for PDF text extraction logic.",
  "frontend/src/quiz/pdfImport/questionExtractionParser.ts": "Empty placeholder file for parsing extracted PDF text into questions.",
  "frontend/src/quiz/QuizEditor.tsx": "Full quiz editing UI including question management, block handling, and recovery of questions from other quizzes.",
  "frontend/src/quiz/QuizGameplay.tsx": "Main quiz gameplay component handling block selection, question loading, adaptive scheduling, answer flow, and optional translation.",
  "frontend/src/quiz/QuizResults.tsx": "Displays final quiz score, performance breakdown, and actions to replay or return to editing.",
  "frontend/src/quiz/sessionTypes.ts": "Defines interfaces for tracking question performance and overall quiz session state.",
  "frontend/src/quiz/TroubleshootingPanel.tsx": "Shows quiz metadata, question counts, and warnings to help diagnose empty or misconfigured quizzes.",
  "frontend/src/quiz/types.ts": "Re-exports shared Question and QuizId types from the backend.",
  "frontend/src/quiz/validation.ts": "Validates question text, answer counts, and correct-answer selection, returning structured errors.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters with session storage fallback.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom fonts, OKLCH-based color tokens, container settings, animations, and plugin integration.",
  "project_state.json": "Project metadata describing the full-stack ICP app scaffold, tracking features across backend, frontend, auth, quiz flows, UI components, and build/deploy tooling."
}