{
  "backend/main.mo": "Motoko backend actor implementing user profiles, access control, quiz and article storage, and question retrieval with permission checks.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten mapping of frontend file paths to descriptive summaries used for reference or tooling.",
  "frontend/.env.example": "Example environment configuration showing translation API URL options and how to provide backend canister IDs.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining the cyber-themed OKLCH color system, dark mode, and safe-area insets.",
  "frontend/index.html": "HTML entry point that forces dark mode and loads env.json at runtime before bootstrapping the React app.",
  "frontend/public/env.json": "Runtime environment file containing a placeholder backend canister ID and build metadata fields.",
  "frontend/PUBLISHING.md": "Publishing guide explaining how to deploy the app via the Caffeine editor and configure env.json correctly.",
  "frontend/src/App.tsx": "Main React app handling authentication, view routing, diagnostics, and quiz gameplay flow without study-article routing.",
  "frontend/src/components/AdminStatusPanel.tsx": "Empty placeholder component file.",
  "frontend/src/components/AdminTokenReauthDialog.tsx": "Empty placeholder component file.",
  "frontend/src/components/AppHeaderBrand.tsx": "Brand header component showing app title and metadata using an icon.",
  "frontend/src/components/BuildIdentityFooter.tsx": "Footer displaying build version, timestamp, and deployment ID retrieved from build metadata.",
  "frontend/src/components/DeploymentDiagnosticsPanel.tsx": "React panel that gathers and displays deployment diagnostics, connection info, runtime environment status, and health check results with various actions like copying and sharing.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button that handles Internet Identity authentication and query cache clearing.",
  "frontend/src/components/PendingUpdateBanner.tsx": "Shows a dismissible banner when a new app build is available, allowing users to refresh or ignore it.",
  "frontend/src/components/ProfileSetup.tsx": "UI for initial profile setup that collects a user name and saves it to the backend.",
  "frontend/src/config/index.ts": "Configures canister actor creation, agent host selection, declaration loading, and connection info resolution.",
  "frontend/src/config/translation.ts": "Simple translation utility that sends text to a translation API and returns the translated result.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBackupRestore.ts": "Hook for exporting and restoring full application state via snapshot serialization and backend calls.",
  "frontend/src/hooks/useExportAllQuestions.ts": "Hook that exports all quizzes with their questions and block names, handling errors and diagnostics recording.",
  "frontend/src/hooks/useGenerateArticle.ts": "Provides a React Query hook that requests an article from an actor and validates/normalizes its content.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity React context and provider handling login, identity loading, and status tracking via AuthClient.",
  "frontend/src/hooks/usePendingUpdate.ts": "Checks if the app build has changed since last visit and exposes a flag and method to mark the current build as seen.",
  "frontend/src/hooks/usePressHold.ts": "Tracks press‑and‑hold interactions and returns a boolean state plus pointer and keyboard event handlers.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, quizzes, and questions through the actor API.",
  "frontend/src/hooks/useQuestionTranslation.ts": "Manages translation requests with caching, deduping, and error handling for question text.",
  "frontend/src/hooks/useQuizRecovery.ts": "Provides logic to copy questions from one quiz to another and invalidate relevant queries.",
  "frontend/src/index.css": "Imports the global theme stylesheet wrapper.",
  "frontend/src/main.tsx": "Sets up the React app root with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/quiz/adaptiveScheduler.ts": "Implements an adaptive question scheduler with first-pass randomization, repeat logic, and mastery tracking.",
  "frontend/src/quiz/BackupRestorePanel.tsx": "UI panel enabling users to export quiz backups to JSON and restore them with confirmation prompts.",
  "frontend/src/quiz/blockUtils.ts": "Utility helpers for dividing questions into 100-question blocks and labeling or extracting block ranges.",
  "frontend/src/quiz/draftStorage.ts": "Handles saving, loading, and clearing quiz drafts in localStorage with versioned serialization.",
  "frontend/src/quiz/imageUtils.ts": "Utilities for validating JPEG files, converting to bytes, creating previews, and producing ExternalBlobs.",
  "frontend/src/quiz/pdfImport/PdfImportPreview.tsx": "Empty placeholder file for PDF import preview UI.",
  "frontend/src/quiz/pdfImport/pdfImportTypes.ts": "Empty placeholder for PDF import type definitions.",
  "frontend/src/quiz/pdfImport/pdfTextExtractor.ts": "Empty placeholder intended for PDF text extraction logic.",
  "frontend/src/quiz/pdfImport/questionExtractionParser.ts": "Empty placeholder for parsing extracted PDF text into quiz questions.",
  "frontend/src/quiz/PreGameQuestionCountView.tsx": "UI for selecting number of quiz questions with loading, validation, and slider controls.",
  "frontend/src/quiz/PreQuizSummaryView.tsx": "Shows a summary of selected block and question count before starting a quiz with validation and navigation options.",
  "frontend/src/quiz/QuestionImagePicker.tsx": "Handles JPEG image upload, validation, preview, removal, and progress tracking for a question.",
  "frontend/src/quiz/QuizEditor.tsx": "Full quiz editor supporting question management, blocks, recovery, exporting, image attachments, and draft handling.",
  "frontend/src/quiz/quizFlowDiagnostics.ts": "Provides optional console-based quiz flow diagnostics controlled via localStorage.",
  "frontend/src/quiz/QuizGameplay.tsx": "Manages full quiz flow including block selection, question count, randomized session creation, answering, translation, and scoring.",
  "frontend/src/quiz/QuizResults.tsx": "Displays final quiz score with options to replay, review wrong answers, or return to editor.",
  "frontend/src/quiz/QuizScoreBar.tsx": "Fixed bottom bar showing current quiz score and answered count.",
  "frontend/src/quiz/randomSubset.ts": "Generates randomized index subsets using Fisher-Yates shuffle with clamped sizes.",
  "frontend/src/quiz/sessionTypes.ts": "Defines interfaces for tracking question performance and session state.",
  "frontend/src/quiz/StudyArticleView.tsx": "Renders a study-article view for a question with back handling and optional article content display.",
  "frontend/src/quiz/TroubleshootingPanel.tsx": "Provides a collapsible panel showing quiz lists and question counts for diagnosing data issues.",
  "frontend/src/quiz/types.ts": "Re-exports Question and QuizId types from backend.",
  "frontend/src/quiz/validation.ts": "Validates quiz questions, ensuring required content, answer counts, non-empty answers, and valid correct-answer indexes.",
  "frontend/src/quiz/WrongAnswersReview.tsx": "Displays a scrollable list of wrong answers with question text and an escape-triggered back action.",
  "frontend/src/quiz/wrongAnswerTypes.ts": "Defines the WrongAnswerEntry interface for tracking wrong-answer review metadata.",
  "frontend/src/types/env.d.ts": "Declares environment variable types for Vite and window.__ENV__ runtime metadata.",
  "frontend/src/utils/actorConnectionInfo.ts": "Resolves backend connection details including host, network, and canister ID via sync or async methods.",
  "frontend/src/utils/buildStamp.ts": "Generates and caches build metadata prioritizing runtime env.json and provides a stable build identifier.",
  "frontend/src/utils/canisterIdResolution.ts": "Resolves backend canister ID from multiple sources with priority ordering and diagnostic tracking.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Collects, stores, and formats deployment-related errors with environment and connection metadata.",
  "frontend/src/utils/formatPublishChecklist.ts": "Builds a detailed publish checklist including build info, canister resolution details, and deployment instructions.",
  "frontend/src/utils/liveReadiness.ts": "Evaluates production readiness based on canister ID validity and backend health check results.",
  "frontend/src/utils/quizExport.ts": "Exports quiz data to downloadable JSON files and generates timestamped filenames.",
  "frontend/src/utils/refreshToLatestBuild.ts": "Performs a full hard refresh by clearing storage, unregistering service workers, deleting caches, logging errors, and reloading with a cache‑busting URL.",
  "frontend/src/utils/runtimeEnvStatus.ts": "Inspects env.json loading status and backend canister ID validity, returning diagnostics and troubleshooting guidance.",
  "frontend/src/utils/shareLiveVerificationInfo.ts": "Generates a detailed plain‑text verification report including build metadata, canister resolution, env.json status, network info, and health check results.",
  "frontend/src/utils/stateSnapshotJson.ts": "Serializes and deserializes full state snapshots with ExternalBlob URL handling and provides basic format validation.",
  "frontend/src/utils/stoppedCanisterDetection.ts": "Detects stopped‑canister errors, extracts canister IDs, formats messages, and offers recovery steps for local or remote environments.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters across query strings and hash routing using sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom fonts, color tokens, animations, and UI extensions.",
  "project_state.json": "Tracks project state, feature requests, and known build issues for removing study-article access and fixing deployment errors.",
  "unknown.txt": "Notes and template logic for generating study articles, including future prompt-building steps and admin permission checks."
}