{
  "backend/main.mo": "Motoko canister providing access-controlled user profiles and quiz data with storage mixins and various query/update methods.",
  "feature_evidence.json": "Feature evidence report mapping UI and behavior requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Text file listing concise summaries of major frontend source files for reference.",
  "frontend/.env.example": "Example environment config showing translation API and backend canister ID settings.",
  "frontend/index.css": "Global Tailwind/shadcn base styling with OKLCH theme variables and quiz gameplay layout utilities.",
  "frontend/index.html": "HTML bootstrap page loading runtime env.json before starting the React app.",
  "frontend/public/env.json": "Runtime environment file containing an empty backend canister ID placeholder.",
  "frontend/src/App.tsx": "Main React app controlling authentication, profile flow, diagnostics, quiz navigation, and header visibility behavior.",
  "frontend/src/components/AdminStatusPanel.tsx": "Empty placeholder component file.",
  "frontend/src/components/AdminTokenReauthDialog.tsx": "Empty placeholder dialog component file.",
  "frontend/src/components/BuildIdentityFooter.tsx": "Footer component displaying build version v56 and deployment metadata.",
  "frontend/src/components/DeploymentDiagnosticsPanel.tsx": "Diagnostics panel component that runs health checks, displays errors, and provides export, share, and publish tooling.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button that manages Internet Identity authentication state and triggers auth actions.",
  "frontend/src/components/ProfileSetup.tsx": "Simple onboarding form that saves a user’s name and completes profile setup.",
  "frontend/src/config/index.ts": "Creates configured backend actors, loading IDL dynamically and selecting host based on environment.",
  "frontend/src/config/translation.ts": "Translation utility that sends text to a configurable translation API and returns translated output.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useBackupRestore.ts": "Hook for exporting and restoring full backend state snapshots with validation and error handling.",
  "frontend/src/hooks/useExportAllQuestions.ts": "Hook that exports all quizzes, questions, and block names, capturing diagnostics on failures.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity context and provider managing auth client creation, login, logout, and identity state.",
  "frontend/src/hooks/usePressHold.ts": "React hook tracking press-and-hold state with pointer and keyboard handlers.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping actor calls for profiles, quizzes, questions, and counts with error reporting.",
  "frontend/src/hooks/useQuestionTranslation.ts": "Provides cached async translation for text with status and error handling.",
  "frontend/src/hooks/useQuizRecovery.ts": "Restores questions from one quiz to another and invalidates related queries.",
  "frontend/src/index.css": "Imports global theme stylesheet.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers.",
  "frontend/src/quiz/adaptiveScheduler.ts": "Implements an adaptive question scheduler with mastery logic, random first-pass ordering, and spacing rules for repeats.",
  "frontend/src/quiz/BackupRestorePanel.tsx": "UI panel for exporting quiz data to JSON and restoring from uploaded backups.",
  "frontend/src/quiz/blockUtils.ts": "Provides helpers for splitting questions into 100-question blocks and generating labels and ranges.",
  "frontend/src/quiz/draftStorage.ts": "Manages localStorage drafts of quizzes, including saving, loading, clearing, and version validation.",
  "frontend/src/quiz/imageUtils.ts": "Utilities for validating JPEGs, converting files to blobs, generating preview URLs, and creating ExternalBlobs.",
  "frontend/src/quiz/pdfImport/PdfImportPreview.tsx": "Empty placeholder file for PDF import preview UI.",
  "frontend/src/quiz/pdfImport/pdfImportTypes.ts": "Empty placeholder for PDF import type definitions.",
  "frontend/src/quiz/pdfImport/pdfTextExtractor.ts": "Empty placeholder for PDF text extraction logic.",
  "frontend/src/quiz/pdfImport/questionExtractionParser.ts": "Empty placeholder for parsing extracted PDF text into questions.",
  "frontend/src/quiz/PreGameQuestionCountView.tsx": "Selects number of questions before starting a quiz, with loading and validation states.",
  "frontend/src/quiz/PreQuizSummaryView.tsx": "Shows summary of selected block and question count before starting a quiz with validation.",
  "frontend/src/quiz/QuestionImagePicker.tsx": "Image upload component for quiz questions supporting JPEG validation, progress display, and removal.",
  "frontend/src/quiz/QuizEditor.tsx": "Main quiz editing interface handling question management, recovery, exporting, and block operations.",
  "frontend/src/quiz/quizFlowDiagnostics.ts": "Provides optional console-based diagnostics for quiz flow and actions, enabled via localStorage.",
  "frontend/src/quiz/QuizGameplay.tsx": "Runs the quiz flow including block selection, question selection, adaptive scheduling, answering, and translations.",
  "frontend/src/quiz/QuizResults.tsx": "Displays final quiz score with options to replay, review wrong answers, or return to editor.",
  "frontend/src/quiz/randomSubset.ts": "Creates randomized subsets of question indices using Fisher-Yates shuffle.",
  "frontend/src/quiz/sessionTypes.ts": "Defines TypeScript types for question performance metrics and session state.",
  "frontend/src/quiz/TroubleshootingPanel.tsx": "Shows quiz data diagnostics including question counts and warnings about missing or conflicting quiz data.",
  "frontend/src/quiz/types.ts": "Re-exports Question and QuizId types from the backend.",
  "frontend/src/quiz/validation.ts": "Validates quiz questions for content, answer counts, and correct answer selection, returning structured errors.",
  "frontend/src/quiz/WrongAnswersReview.tsx": "Lists incorrectly answered questions with navigation back support and scrollable review UI.",
  "frontend/src/quiz/wrongAnswerTypes.ts": "Defines types for tracking wrong-answer review entries.",
  "frontend/src/types/env.d.ts": "Declares environment variable typings for Vite build and runtime configuration.",
  "frontend/src/utils/actorConnectionInfo.ts": "Resolves backend canister connection info, determining host, network, and resolution source.",
  "frontend/src/utils/buildStamp.ts": "Generates build metadata including timestamp, version, environment, and a stable deployment ID.",
  "frontend/src/utils/canisterIdResolution.ts": "Resolves backend canister ID from multiple sources with detailed source tracking and error reporting.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Collects, stores, and formats deployment-related errors, including metadata and reporting utilities.",
  "frontend/src/utils/formatPublishChecklist.ts": "Generates a plain‑text checklist for publishing a draft build to a live canister with build and canister details.",
  "frontend/src/utils/liveReadiness.ts": "Evaluates whether the app is ready for live use based on canister ID resolution and backend health checks.",
  "frontend/src/utils/quizExport.ts": "Provides helpers to export quiz data as JSON, trigger downloads, and generate timestamped filenames.",
  "frontend/src/utils/refreshToLatestBuild.ts": "Performs a hard refresh by clearing storage, unregistering service workers, clearing caches, and reloading with cache‑busting.",
  "frontend/src/utils/runtimeEnvStatus.ts": "Inspects runtime env.json configuration and reports whether CANISTER_ID_BACKEND and environment data are correctly loaded.",
  "frontend/src/utils/shareLiveVerificationInfo.ts": "Formats live verification info including build metadata, canister resolution, and health check results for sharing.",
  "frontend/src/utils/stateSnapshotJson.ts": "Serializes and deserializes full state snapshots to JSON, handling ExternalBlob conversion and validating structure.",
  "frontend/src/utils/stoppedCanisterDetection.ts": "Provides utilities to detect IC0508 stopped-canister errors, extract canister IDs, format user messages, and offer recovery steps.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters using both query strings and hash routing, with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, fonts, container settings, animations, and plugin integrations.",
  "project_state.json": "Defines project metadata, known issues, and feature requests focused on rolling back UI and behavior to Version 56."
}