{
  "backend/main.mo": "Motoko canister implementing user profiles, access control, and quiz question storage with query and update methods for listing and retrieving quizzes.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files for documentation or build reference.",
  "frontend/.env.example": "Example environment file showing configuration for the translation API URL.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining the app theme, dark mode, mobile utilities, and safe-area support.",
  "frontend/index.html": "Base HTML page loading the React app entry point.",
  "frontend/src/App.tsx": "Main React component handling authentication, profile setup, quiz views, diagnostics, and actor initialization error handling.",
  "frontend/src/components/AdminStatusPanel.tsx": "Placeholder or empty component file for an admin status panel.",
  "frontend/src/components/AdminTokenReauthDialog.tsx": "Empty file intended for an admin token reauthentication dialog.",
  "frontend/src/components/DeploymentDiagnosticsPanel.tsx": "UI panel that displays deployment diagnostics, allows clearing and downloading logs, and runs backend health checks via the actor.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that logs users in or out using Internet Identity while handling edge cases and UI states.",
  "frontend/src/components/ProfileSetup.tsx": "Simple onboarding form that saves a user's name and triggers completion once submitted.",
  "frontend/src/config/index.ts": "Configuration utilities for creating backend actors, resolving canister IDs, determining host, and loading IDL dynamically.",
  "frontend/src/config/translation.ts": "Client helper for translating text through a configurable API endpoint with fallback error handling.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches the backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useBackupRestore.ts": "Hook providing logic to export and restore full backend state snapshots with validation and error handling.",
  "frontend/src/hooks/useExportAllQuestions.ts": "Hook that exports all quizzes, their questions, and block metadata, capturing diagnostics on failures.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and provider for managing Internet Identity login, logout, stored identities, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Provides multiple React Query hooks to fetch and mutate quiz data using an actor, including profiles, quizzes, question counts, and question lists.",
  "frontend/src/hooks/useQuestionTranslation.ts": "Implements a translation hook with caching, state tracking, and accessors for translating question text from German to English.",
  "frontend/src/hooks/useQuizRecovery.ts": "Adds logic to restore questions from one quiz to another using the actor API and invalidates related query caches.",
  "frontend/src/index.css": "Imports the global stylesheet wrapper.",
  "frontend/src/main.tsx": "Bootstraps the React app by mounting providers for React Query and Internet Identity and rendering the main App component.",
  "frontend/src/quiz/adaptiveScheduler.ts": "Implements an adaptive question scheduler with mastery-based repeats, random first-pass ordering, and spacing rules.",
  "frontend/src/quiz/BackupRestorePanel.tsx": "UI component allowing users to export all quiz data to a JSON file or restore data from an uploaded backup file.",
  "frontend/src/quiz/blockUtils.ts": "Utility functions for computing 100-question blocks, labels, ranges, and slicing question arrays.",
  "frontend/src/quiz/draftStorage.ts": "Handles saving, loading, and clearing localStorage drafts of quiz questions with versioning.",
  "frontend/src/quiz/imageUtils.ts": "Helpers for validating JPEG files, reading files to bytes, creating previews, and generating ExternalBlob URLs.",
  "frontend/src/quiz/pdfImport/PdfImportPreview.tsx": "Empty placeholder file for PDF import preview UI.",
  "frontend/src/quiz/pdfImport/pdfImportTypes.ts": "Empty placeholder for PDF import type definitions.",
  "frontend/src/quiz/pdfImport/pdfTextExtractor.ts": "Empty placeholder for PDF text extraction logic.",
  "frontend/src/quiz/pdfImport/questionExtractionParser.ts": "Empty placeholder for parsing extracted PDF text into questions.",
  "frontend/src/quiz/QuestionImagePicker.tsx": "Component for uploading, previewing, validating, and removing JPG images associated with quiz questions.",
  "frontend/src/quiz/QuizEditor.tsx": "Main editor UI for managing quiz questions, images, blocks, recovery, exports, and related interactions using various hooks and utilities.",
  "frontend/src/quiz/QuizGameplay.tsx": "Main quiz gameplay component handling block selection, adaptive scheduling, translations, answer submission, and feedback UI.",
  "frontend/src/quiz/QuizResults.tsx": "Displays final quiz results, score breakdown, and actions to replay or return to editing.",
  "frontend/src/quiz/sessionTypes.ts": "Defines question performance tracking and session state structures for quiz sessions.",
  "frontend/src/quiz/TroubleshootingPanel.tsx": "Collapsible panel showing quiz data, counts, and warnings to help debug missing or inconsistent quiz content.",
  "frontend/src/quiz/types.ts": "Re-exports Question and QuizId types from the backend.",
  "frontend/src/quiz/validation.ts": "Validates quiz questions, checking text, images, answer counts, and correct-answer selection.",
  "frontend/src/utils/actorConnectionInfo.ts": "Resolves agent host, canister ID, and network by checking env vars, env.json, or URL for IC deployments.",
  "frontend/src/utils/buildStamp.ts": "Generates and logs build metadata including timestamp, version, environment, and a session-stable deployment ID.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Collects, stores, and formats deployment-related errors with build and connection metadata for troubleshooting.",
  "frontend/src/utils/quizExport.ts": "Exports quiz data to downloadable JSON and generates timestamped filenames for quiz exports.",
  "frontend/src/utils/stateSnapshotJson.ts": "Serializes and deserializes full state snapshots, handling ExternalBlob conversion and validating snapshot structure.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, persist, and clear URL parameters across navigation using URL parsing and sessionStorage.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, typography, container rules, animations, and extended theme settings.",
  "project_state.json": "Defines project state, feature requirements, and a known issue about unsaved quiz editor input being lost on navigation."
}