{
  "backend/main.mo": "Motoko canister providing access‑controlled user profiles and quiz storage with queries for questions, chunks, and quiz metadata.",
  "feature_evidence.json": "Feature evidence report describing removal of the software‑update banner and listing affected frontend files and components.",
  "frontend-file-summaries.txt": "JSON map summarizing key frontend files, including styling, quiz logic, editors, gameplay, and update‑banner removal.",
  "frontend/.env.example": "Example environment configuration for translation API and backend canister ID setup.",
  "frontend/index.css": "Tailwind‑based global theme defining OKLCH color variables for light/dark modes plus mobile safe‑area insets.",
  "frontend/index.html": "HTML entry point that forces dark mode, loads runtime env.json before React, and mounts the app.",
  "frontend/public/env.json": "Runtime environment file containing an empty backend canister ID placeholder.",
  "frontend/src/App.tsx": "Main React app handling auth, profile loading, view switching, diagnostics, stopped‑canister detection, and quiz/editor navigation.",
  "frontend/src/components/AdminStatusPanel.tsx": "Empty placeholder component file.",
  "frontend/src/components/AdminTokenReauthDialog.tsx": "Empty placeholder component file.",
  "frontend/src/components/BuildIdentityFooter.tsx": "Footer showing build version, timestamp, and deployment ID.",
  "frontend/src/components/DeploymentDiagnosticsPanel.tsx": "Diagnostics UI providing error logs, health checks, runtime env inspection, and publish‑checklist tooling.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button using Internet Identity, handling auth state and query cache reset.",
  "frontend/src/components/PendingUpdateBanner.tsx": "Placeholder banner component that currently renders nothing.",
  "frontend/src/components/ProfileSetup.tsx": "Form for entering and saving a user's name, then calling onComplete after profile creation.",
  "frontend/src/config/index.ts": "Configures and creates backend actors with dynamic IDL loading, agent setup, and environment-based host selection.",
  "frontend/src/config/translation.ts": "Implements a translation helper that forwards requests to a configurable or fallback translation API.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and refreshes related queries when it changes.",
  "frontend/src/hooks/useBackupRestore.ts": "Provides backup export and restore functions using the backend's state APIs with validation and query invalidation.",
  "frontend/src/hooks/useExportAllQuestions.ts": "Exports all quiz questions and metadata by fetching quiz IDs and assembling full quiz data from the backend.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login flow, stored identities, and provides an authentication context.",
  "frontend/src/hooks/usePendingUpdate.ts": "Detects when a new build is available by comparing stored and current build IDs.",
  "frontend/src/hooks/usePressHold.ts": "Tracks press-and-hold interactions with pointer and keyboard events and returns press state with handlers.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, quizzes, question counts, and questions via an actor API with error diagnostics.",
  "frontend/src/hooks/useQuestionTranslation.ts": "Custom hook providing cached async translation for text with state tracking and error handling.",
  "frontend/src/hooks/useQuizRecovery.ts": "Hook to copy questions from one quiz to another and invalidate related React Query caches with recovery state tracking.",
  "frontend/src/index.css": "Imports the global theme stylesheet.",
  "frontend/src/main.tsx": "App entry point setting up React, React Query, and Internet Identity providers.",
  "frontend/src/quiz/adaptiveScheduler.ts": "Implements an adaptive scheduling algorithm managing question order, repeat logic, mastery, and spacing rules.",
  "frontend/src/quiz/BackupRestorePanel.tsx": "UI panel to export quiz data to a JSON file and restore from a selected backup with confirmation and status handling.",
  "frontend/src/quiz/blockUtils.ts": "Utility functions for handling 100‑question block ranges, labels, indexing, and extraction.",
  "frontend/src/quiz/draftStorage.ts": "Handles saving, loading, validating, and clearing quiz drafts in localStorage using versioned serialization.",
  "frontend/src/quiz/imageUtils.ts": "Provides JPEG validation, file-to-bytes conversion, preview URL creation, and ExternalBlob helpers.",
  "frontend/src/quiz/pdfImport/PdfImportPreview.tsx": "Empty placeholder file for PDF import preview UI.",
  "frontend/src/quiz/pdfImport/pdfImportTypes.ts": "Empty placeholder for PDF import type definitions.",
  "frontend/src/quiz/pdfImport/pdfTextExtractor.ts": "Empty placeholder for PDF text extraction logic.",
  "frontend/src/quiz/pdfImport/questionExtractionParser.ts": "Empty placeholder for parsing extracted PDF text into quiz questions.",
  "frontend/src/quiz/PreGameQuestionCountView.tsx": "View for choosing the number of questions before starting a quiz, including validation, slider selection, and loading states.",
  "frontend/src/quiz/PreQuizSummaryView.tsx": "Screen summarizing selected block and question count before starting a quiz with validation and navigation controls.",
  "frontend/src/quiz/QuestionImagePicker.tsx": "Component allowing JPG image upload, preview, validation, and removal for quiz questions with progress tracking.",
  "frontend/src/quiz/QuizEditor.tsx": "Large editor component for creating, validating, importing, exporting, and managing quiz questions with recovery, backup, and block utilities.",
  "frontend/src/quiz/quizFlowDiagnostics.ts": "Implements optional quiz-flow debugging logs controlled via localStorage flags.",
  "frontend/src/quiz/QuizGameplay.tsx": "Runs the quiz flow including block selection, question count, adaptive scheduling, translation, and answer handling.",
  "frontend/src/quiz/QuizResults.tsx": "Displays final quiz results with score, wrong answer count, and actions to replay or review mistakes.",
  "frontend/src/quiz/QuizScoreBar.tsx": "Fixed bottom bar showing current correct and answered question counts.",
  "frontend/src/quiz/randomSubset.ts": "Provides a Fisher-Yates shuffle and random index subset generator.",
  "frontend/src/quiz/sessionTypes.ts": "Defines interfaces for tracking per-question performance and overall session state.",
  "frontend/src/quiz/TroubleshootingPanel.tsx": "Expandable panel showing quiz metadata, question counts, and warnings for troubleshooting data issues.",
  "frontend/src/quiz/types.ts": "Re-exports Question and QuizId types from the backend.",
  "frontend/src/quiz/validation.ts": "Validates quiz questions for required content, answer counts, and correct-answer indexing.",
  "frontend/src/quiz/WrongAnswersReview.tsx": "Scrollable view listing all incorrectly answered questions with a back button and escape‑key support.",
  "frontend/src/quiz/wrongAnswerTypes.ts": "Defines the WrongAnswerEntry type for wrong-answer review.",
  "frontend/src/types/env.d.ts": "Type declarations for Vite environment variables and window-provided env JSON.",
  "frontend/src/utils/actorConnectionInfo.ts": "Resolves backend canister connection info, determining host, canister ID, and network.",
  "frontend/src/utils/buildStamp.ts": "Generates build metadata including version, timestamps, deployment ID, and stable build ID.",
  "frontend/src/utils/canisterIdResolution.ts": "Resolves backend canister ID from multiple prioritized sources with detailed tracking.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Collects, stores, and formats deployment-related diagnostic errors with environment context.",
  "frontend/src/utils/formatPublishChecklist.ts": "Generates a formatted publish checklist string using build and canister connection info.",
  "frontend/src/utils/liveReadiness.ts": "Evaluates deployment readiness based on canister ID resolution and backend health checks.",
  "frontend/src/utils/quizExport.ts": "Provides quiz export helpers including JSON download and timestamped filename generation.",
  "frontend/src/utils/refreshToLatestBuild.ts": "Performs a hard refresh by clearing storage, unregistering service workers, clearing caches, and reloading with cache-busting.",
  "frontend/src/utils/runtimeEnvStatus.ts": "Inspects env.json loading status and CANISTER_ID_BACKEND presence to diagnose runtime config issues.",
  "frontend/src/utils/shareLiveVerificationInfo.ts": "Builds a detailed live verification report including build details, canister info, and health check results.",
  "frontend/src/utils/stateSnapshotJson.ts": "Serializes and deserializes full state snapshots with ExternalBlob handling and basic validation.",
  "frontend/src/utils/stoppedCanisterDetection.ts": "Detects stopped-canister errors, extracts canister IDs, formats messages, and provides recovery steps.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash routes), storing/retrieving them in sessionStorage, and clearing them when needed.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom themes, colors, fonts, animations, and plugin setup.",
  "project_state.json": "JSON file describing the project's state, features, and requests related to removing the software update pop-up."
}