{
  "backend/main.mo": "Motoko canister managing user profiles and per-user quiz sets with access control, including CRUD-like queries for quizzes and questions.",
  "feature_evidence.json": "Feature evidence report listing three UI/translation-related frontend requirements tied to QuizGameplay.tsx.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all major frontend files, features, and behaviors including quiz editing, gameplay, and translation UI.",
  "frontend/.env.example": "Environment template defining configurable translation API endpoint for frontend translation requests.",
  "frontend/index.css": "Global Tailwind theme defining OKLCH color variables and utilities for a warm educational light/dark mode palette.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main SPA controller handling authentication, profile setup, and switching between quiz editor, gameplay, and results views.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity login/logout button with loading state and query cache clearing.",
  "frontend/src/components/ProfileSetup.tsx": "Modal form for first-time users to submit and save their display name.",
  "frontend/src/config/translation.ts": "Client-side translation utility wrapping a configurable translation API with error handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout functionality, and initializes AuthClient with stored or new identities.",
  "frontend/src/hooks/useQueries.ts": "Wraps common backend queries and mutations for profiles, quizzes, and questions using React Query and the actor API.",
  "frontend/src/hooks/useQuestionTranslation.ts": "Handles translation requests for question text with caching, error tracking, and translation state management.",
  "frontend/src/hooks/useQuizRecovery.ts": "Allows restoring questions from one quiz to another and invalidates affected queries while tracking recovery state and errors.",
  "frontend/src/index.css": "Imports the global stylesheet wrapper.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers before rendering the root component.",
  "frontend/src/quiz/adaptiveScheduler.ts": "Implements an adaptive question scheduler with randomized order, repeat logic, and performance tracking.",
  "frontend/src/quiz/pdfImport/PdfImportPreview.tsx": "Empty placeholder file for PDF import preview UI.",
  "frontend/src/quiz/pdfImport/pdfImportTypes.ts": "Empty file intended to hold PDF import-related TypeScript types.",
  "frontend/src/quiz/pdfImport/pdfTextExtractor.ts": "Empty file intended for PDF text extraction logic.",
  "frontend/src/quiz/pdfImport/questionExtractionParser.ts": "Empty file intended to parse extracted PDF text into quiz questions.",
  "frontend/src/quiz/QuizEditor.tsx": "Provides a UI for editing quizzes, managing questions, saving changes, and optionally restoring content from other quizzes.",
  "frontend/src/quiz/QuizGameplay.tsx": "Runs the quiz gameplay loop with adaptive scheduling, answer handling, progress tracking, and optional question translation.",
  "frontend/src/quiz/QuizResults.tsx": "Displays quiz results with score breakdown, encouragement message, and buttons to replay or edit questions.",
  "frontend/src/quiz/sessionTypes.ts": "Defines interfaces for tracking question performance and overall quiz session state.",
  "frontend/src/quiz/TroubleshootingPanel.tsx": "Shows a collapsible panel listing quizzes and their question counts, highlighting issues like empty current quizzes.",
  "frontend/src/quiz/types.ts": "Re-exports Question and QuizId types from the backend.",
  "frontend/src/quiz/validation.ts": "Validates quiz questions, ensuring required text, valid answer counts, and a correct answer selection.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending themes, colors, fonts, animations, and container settings.",
  "project_state.json": "Defines the project’s versioned state and lists existing features of an ICP Motoko + React app scaffold, including auth, quiz flows, PDF import, and UI/build templates."
}