{
  "kind": "build_request",
  "title": "Remove study-article access from Wrong Answers Review and resolve deployment configuration failure",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the educational/study-article functionality from the Wrong Answers Review flow so users cannot open or view a Study Article from the wrong-question review experience.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-8"
        ],
        "quotes": [
          "Remove educational article function from wrong guestion review as I asking before, it is still there",
          "yes, fix it and run again"
        ]
      },
      "acceptanceCriteria": [
        "The Wrong Answers Review screen (frontend/src/quiz/WrongAnswersReview.tsx) contains no UI affordance to open a study article (no click-to-open behavior, buttons, links, or navigation).",
        "The app no longer navigates to the Study Article view from any wrong-answers review action; the 'studyArticle' view is not reachable through the wrong-answer review flow.",
        "Wrong answer review entries no longer carry or rely on a 'studyArticle' field in the frontend data flow (update frontend/src/quiz/wrongAnswerTypes.ts and the place where wrong-answers are assembled in frontend/src/quiz/QuizGameplay.tsx accordingly).",
        "Any now-unused state, handlers, imports, and view routing related to opening StudyArticleView from wrong-answer review are removed from frontend/src/App.tsx (e.g., selectedStudyQuestion, handleStudyQuestion, and the 'studyArticle' view branch), without breaking other views."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the configuration issue preventing builds/deployments from running successfully, and ensure the app can be rebuilt and redeployed after the fix.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-7",
          "msg-8"
        ],
        "quotes": [
          "⚠️ Configuration error found. Please contact the Caffeine team for assistance.",
          "It looks like the last build hit a configuration issue — want me to try running it again now?",
          "yes, fix it and run again"
        ]
      },
      "acceptanceCriteria": [
        "The project builds successfully without triggering a configuration error.",
        "The deployed preview can initialize the backend actor (i.e., does not fail immediately due to missing/invalid runtime configuration).",
        "If the runtime configuration (/frontend/public/env.json) contains the placeholder canister id value (\"PLACEHOLDER_BACKEND_CANISTER_ID\"), the UI clearly surfaces this as a configuration problem (via existing diagnostics/connection error UI) and provides actionable steps, rather than failing silently."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only Shadcn components).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Keep all backend logic in the single Motoko actor (backend/main.mo); only add backend/migration.mo if a stable-state schema change is required."
  ],
  "nonGoals": [
    "Do not remove the general quiz gameplay, scoring, or translation features.",
    "Do not add new authentication providers beyond Internet Identity.",
    "Do not introduce external databases or non-Motoko backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}