{
  "kind": "build_request",
  "title": "Publish current draft to production and verify backend canister ID injection",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Publish the current draft build to the live (production) deployment using the Caffeine editor publish flow (the app cannot self-publish). Ensure the publish process injects a real backend canister ID into the live `/env.json` so `CANISTER_ID_BACKEND` is not the placeholder value `PLACEHOLDER_BACKEND_CANISTER_ID`.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "now it looks good, publish this version to production"
        ]
      },
      "acceptanceCriteria": [
        "A live (production) deployment is created from the current draft build via the Caffeine editor publish action.",
        "In the live deployment, fetching `/env.json` returns a JSON object with `CANISTER_ID_BACKEND` set to a non-empty, non-placeholder value (not `PLACEHOLDER_BACKEND_CANISTER_ID`).",
        "No manual edits are made to `frontend/public/env.json` as part of the publish process."
      ]
    },
    {
      "id": "REQ-2",
      "text": "After publishing, verify the live deployment using the in-app Deployment Diagnostics / Deployment Checklist tools to confirm backend connectivity and readiness.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "now it looks good, publish this version to production"
        ]
      },
      "acceptanceCriteria": [
        "In the live deployment, the Deployment Diagnostics panel shows runtime environment status as loaded and not placeholder for the backend canister ID.",
        "The Backend Connection section resolves the backend canister ID from `window.__ENV__.CANISTER_ID_BACKEND`.",
        "Running the in-app health check succeeds (e.g., shows the backend is responding and returns backend version/system time).",
        "Overall readiness status in the diagnostics indicates the app is ready with no critical warnings about canister ID resolution."
      ]
    }
  ],
  "constraints": [
    "Publishing must be performed through the Caffeine editor (the app cannot self-publish).",
    "Do not manually edit `frontend/public/env.json` for production; it must be injected during publish."
  ],
  "nonGoals": [
    "Implementing new product features or UI changes unrelated to publishing.",
    "Changing backend APIs or data schema as part of this publish request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}