{
  "kind": "build_request",
  "title": "Rollback app behavior to match Version 56 and label build as v56",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Restore the application’s UI styling and layout to match Version 56 by removing/undoing the styling/layout changes introduced in later versions (notably Version 58+), ensuring a consistent neutral Shadcn/Tailwind look across the app shell and quiz-related screens (including PreGameQuestionCountView, PreQuizSummaryView, and QuizResults).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "please return in version 56, as newer versions is ruined."
        ]
      },
      "acceptanceCriteria": [
        "PreGameQuestionCountView, PreQuizSummaryView, and QuizResults use the same neutral Shadcn/Tailwind visual treatment (spacing, typography, surfaces, and borders) as the Version 56 baseline.",
        "No new styling/layout regressions are introduced in the app shell and core quiz flow screens compared to the intended Version 56 look."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Restore Version 56 header navigation behavior so that the “Play” and “Edit” header actions are visible throughout the start flow and non-game views, and are hidden only while the user is actively in the in-game question-answering screen (the active quiz step).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "please return in version 56, as newer versions is ruined."
        ]
      },
      "acceptanceCriteria": [
        "When the user is in any non-question-answering view (e.g., editor, pre-game/start flow, results, wrong answers review), the header shows the Play action and (for admins) the Edit action.",
        "While actively answering questions (the in-game question-answering screen), the header Play/Edit actions are hidden.",
        "Switching between views reliably updates header visibility without requiring a page refresh."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the build/version identity shown in the UI to report Version 56 (e.g., the footer build version and any diagnostics build info), so the published build is clearly labeled as v56.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "please return in version 56, as newer versions is ruined."
        ]
      },
      "acceptanceCriteria": [
        "The build version displayed in the BuildIdentityFooter is \"v56\".",
        "Any build version shown in deployment/diagnostics UI reflects \"56\" consistently for the same build."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/immutablePaths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain a single Motoko actor in backend/main.mo; add backend/migration.mo only if a state schema upgrade is required."
  ],
  "nonGoals": [
    "Adding new product features beyond restoring Version 56 look/behavior.",
    "Changing authentication provider (Internet Identity only).",
    "Introducing new backend services, databases, or external integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}