{
  "kind": "build_request",
  "title": "Prepare current build for live publishing (runtime config + accurate build/version diagnostics)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the app’s displayed build/version metadata so it always reflects the actual build (do not hardcode version '56'), including in build info generation and in the Deployment Diagnostics UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "go live with this"
        ]
      },
      "acceptanceCriteria": [
        "In Deployment Diagnostics, the displayed version is sourced from build metadata (e.g., VITE_APP_VERSION) and is not hardcoded to '56'.",
        "The build info utility does not fall back to a fixed version string; if no build-time version is provided, it uses a clearly dynamic fallback (e.g., 'dev' or similar) rather than a specific historic version number.",
        "After rebuilding, the Diagnostics panel and any footer/build info surfaces show consistent version values."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the project is live-publish ready by validating and documenting runtime backend canister configuration via /env.json, and make the live readiness state unambiguous when /env.json is missing or CANISTER_ID_BACKEND is empty.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "go live with this"
        ]
      },
      "acceptanceCriteria": [
        "If frontend/public/env.json is missing in a deployed environment, the app clearly indicates the backend canister ID is not resolved and Live Readiness shows 'Not ready'.",
        "If frontend/public/env.json exists but CANISTER_ID_BACKEND is an empty string, the app treats it as not configured and Live Readiness shows 'Not ready'.",
        "Deployment Diagnostics 'Publish to Live Canister' section instructions remain accurate and explicitly mention that /env.json must include a non-empty CANISTER_ID_BACKEND value for live deployments.",
        "The 'Copy Publish Checklist' output includes the resolved canister ID when available, and clearly shows '(not resolved)' when not available."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn UI components are read-only).",
    "Do not edit immutable frontend hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx."
  ],
  "nonGoals": [
    "Performing the actual live publish/deployment from within the app (publishing is done via the Caffeine editor).",
    "Changing backend canister logic or data schema as part of the go-live task."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}