{
  "kind": "build_request",
  "title": "Prevent Quiz Editor from losing unsaved question edits when switching tabs (regression after adding JPG)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "Prevent the Quiz Editor form from resetting unsaved local question edits when the browser tab/window loses focus and then regains focus (e.g., user switches to another page/tab and returns) by ensuring the questions query does not refetch on window focus and overwrite in-progress edits.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "still problem on admin page when editing / adding new question. If I am in process to add text and visit on other browser page, when returning it have refreshed and lost my earlier input for that particular question."
        ]
      },
      "acceptanceCriteria": [
        "While editing a question (typing in text/answers) without saving, switching to a different tab/window and then returning does not clear or revert the typed inputs.",
        "This behavior is verified both for plain-text questions and questions that have a JPG attached.",
        "No new network fetch is triggered solely due to window/tab focus for the questions list used by the editor (unless explicitly refreshed by the user)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Ensure server-fetched questions do not overwrite in-progress local edits in QuizEditor when React Query updates/refetches the questions data (including after background refetches, invalidations, or image attachment flow), by guarding the \"sync localQuestions from questions\" effect so it does not run when there are unsaved changes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "...when returning it have refreshed and lost my earlier input for that particular question.",
          "...after I add .jpg in one of my questions, rest of the input start behaving wrong"
        ]
      },
      "acceptanceCriteria": [
        "If the questions query updates while hasUnsavedChanges is true, the editor keeps the user’s local edits (text/answers/correct answer/image selection) intact.",
        "After the user presses Save (successful save), the editor state can safely sync to the latest server state again.",
        "An explicit user action to reload (e.g., existing refetch/refresh control if present) continues to work, and if triggered while unsaved changes exist, the UI must require a clear confirmation before discarding local edits."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add draft persistence for in-progress question edits in the Quiz Editor so that accidental reloads or navigations do not lose unsaved input; persist to browser storage keyed by quizId and restore automatically when returning to the editor, with clear English UI text to resume/discard the draft if the server version differs.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "...when returning it have refreshed and lost my earlier input for that particular question."
        ]
      },
      "acceptanceCriteria": [
        "While editing without saving, a page refresh (hard reload) restores the in-progress edits for that quizId from browser storage.",
        "Draft persistence includes question text, answers, correctAnswer, and any attached image ExternalBlob data needed by the editor to continue (or, if an image cannot be restored, the UI clearly indicates the image must be reattached without breaking other draft fields).",
        "After a successful Save, the stored draft for that quizId is cleared automatically.",
        "All user-facing prompts/buttons for draft recovery are in English."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/src/components/ui and the immutable hook files listed in SYSTEM_CONTEXT must not be edited directly; compose existing components instead.",
    "Keep all backend logic in the single Motoko actor (backend/main.mo); do not introduce additional backend services."
  ],
  "nonGoals": [
    "Do not add real-time collaboration or multi-device syncing of in-progress drafts.",
    "Do not change quiz/question data model in the backend unless strictly required for the draft-preservation fix.",
    "Do not implement support for non-JPG image formats beyond the current JPG/JPEG handling."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}