{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Production publish verification and deployment diagnostics hardening",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the production publish flow (via Caffeine editor) injects a real backend canister ID into live /env.json and is verifiable without manual env.json edits.",
      "acceptanceCriteria": [
        "A live (production) deployment is created from the current draft build via the Caffeine editor publish action.",
        "In the live deployment, fetching `/env.json` returns a JSON object with `CANISTER_ID_BACKEND` set to a non-empty, non-placeholder value (not `PLACEHOLDER_BACKEND_CANISTER_ID`).",
        "No manual edits are made to `frontend/public/env.json` as part of the publish process."
      ],
      "file_operations": [
        {
          "path": "frontend/PUBLISHING.md",
          "operation": "modify",
          "description": "Tighten and clarify the publish + verification instructions to explicitly (a) require publishing via the Caffeine editor, (b) confirm that /env.json is injected at publish time, and (c) restate that frontend/public/env.json must not be manually edited for production. Ensure the doc points to the in-app diagnostics checks as the canonical verification method."
        },
        {
          "path": "frontend/src/components/DeploymentDiagnosticsPanel.tsx",
          "operation": "modify",
          "description": "Harden the /env.json verification UX to make it unambiguous when the backend canister ID is placeholder/empty vs valid, and to clearly instruct that fixing requires republishing via the Caffeine editor (not editing frontend/public/env.json). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/runtimeEnvStatus.ts",
          "operation": "modify",
          "description": "Ensure runtime environment status messaging is explicit about the placeholder value and provides publish-flow-specific troubleshooting guidance suitable for production verification (without suggesting manual env.json edits)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Verify live deployment readiness using the in-app Deployment Diagnostics/Checklist, including runtime env status, backend canister ID resolution source, and health check.",
      "acceptanceCriteria": [
        "In the live deployment, the Deployment Diagnostics panel shows runtime environment status as loaded and not placeholder for the backend canister ID.",
        "The Backend Connection section resolves the backend canister ID from `window.__ENV__.CANISTER_ID_BACKEND`.",
        "Running the in-app health check succeeds (e.g., shows the backend is responding and returns backend version/system time).",
        "Overall readiness status in the diagnostics indicates the app is ready with no critical warnings about canister ID resolution."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the Deployment Diagnostics / Deployment Checklist UI into the live app shell so it can be opened in production (e.g., from the header/footer) after login. Ensure the wiring does not introduce new top-level routes and is accessible for post-publish verification. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/DeploymentDiagnosticsPanel.tsx",
          "operation": "modify",
          "description": "Ensure the 'Backend Connection' section explicitly displays the resolved canister ID and the resolution source, and highlights when the source is `window.__ENV__.CANISTER_ID_BACKEND` (required for live publish verification). Ensure the health check UI clearly reports success/failure and surfaces backendVersion/systemTime. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/actorConnectionInfo.ts",
          "operation": "modify",
          "description": "Ensure the connection-info utility used by diagnostics reliably labels the runtime-injected source as `window.__ENV__.CANISTER_ID_BACKEND` and propagates any resolution error text so the readiness evaluation can produce accurate critical warnings."
        },
        {
          "path": "frontend/src/utils/liveReadiness.ts",
          "operation": "modify",
          "description": "Adjust readiness evaluation to treat missing/placeholder canister ID and non-runtime sources (when verifying production) as critical warnings, and to mark readiness as passing only when runtime env is loaded, canister ID is valid (non-placeholder), and health check succeeds."
        }
      ]
    }
  ]
}