{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Rollback UI/behavior to Version 56 and label build as v56",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Restore Version 56 neutral Shadcn/Tailwind styling and layout across app shell and quiz flow screens (PreGameQuestionCountView, PreQuizSummaryView, QuizResults).",
      "acceptanceCriteria": [
        "PreGameQuestionCountView, PreQuizSummaryView, and QuizResults use the same neutral Shadcn/Tailwind visual treatment (spacing, typography, surfaces, and borders) as the Version 56 baseline.",
        "No new styling/layout regressions are introduced in the app shell and core quiz flow screens compared to the intended Version 56 look."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Revert app shell layout/styling to the Version 56 baseline (header/footer spacing, container widths, background/surface usage) to maintain a neutral shadcn/ui + Tailwind look. Use the shadcn-ui component library (e.g., Card/Button/Alert patterns already in use) to keep surfaces and typography consistent. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/quiz/PreGameQuestionCountView.tsx",
          "operation": "modify",
          "description": "Adjust spacing/typography/surfaces/borders to match the Version 56 neutral styling (e.g., container padding, Card spacing, button grouping) while continuing to use shadcn/ui primitives (Card, Button, Slider, Alert, Skeleton). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/quiz/PreQuizSummaryView.tsx",
          "operation": "modify",
          "description": "Align summary screen visual treatment with Version 56 (consistent Card sections, border usage, spacing, and typography) using existing shadcn/ui components. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/quiz/QuizResults.tsx",
          "operation": "modify",
          "description": "Revert results screen styling to Version 56 neutral treatment (score layout, muted surfaces, spacing, and button stack) using shadcn/ui primitives consistently. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/quiz/QuizGameplay.tsx",
          "operation": "modify",
          "description": "Remove/undo any post-v56 gameplay layout/styling deviations that affect the overall quiz flow look-and-feel (e.g., overly custom gameplay container styling, non-neutral surface/border treatments) to keep a consistent shadcn/Tailwind appearance around the pre-game and results experience. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/index.css",
          "operation": "modify",
          "description": "Revert/adjust any global CSS utilities introduced after v56 that alter the quiz flow layout/styling (including .quiz-gameplay-* helpers) so the overall UI matches the Version 56 neutral Shadcn/Tailwind baseline without regressions."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Restore Version 56 header navigation visibility: Play/Edit shown in non-question-answering views and hidden only during the active in-game question-answering step.",
      "acceptanceCriteria": [
        "When the user is in any non-question-answering view (e.g., editor, pre-game/start flow, results, wrong answers review), the header shows the Play action and (for admins) the Edit action.",
        "While actively answering questions (the in-game question-answering screen), the header Play/Edit actions are hidden.",
        "Switching between views reliably updates header visibility without requiring a page refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Adjust header visibility logic to match Version 56: show Play/Edit throughout start flow and non-game views, and hide only while the user is in the active question-answering step. Ensure state updates correctly when switching between gameplay sub-steps, results, wrong-answers review, and editor (no refresh required). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/quiz/QuizGameplay.tsx",
          "operation": "modify",
          "description": "Ensure the gameplay step-change notification to the app shell only indicates 'active quiz' during the in-game question-answering step (not during block selection/question count/summary), so header Play/Edit actions remain visible throughout the start flow per v56. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update UI build/version identity to display Version 56 (v56) consistently in footer and diagnostics.",
      "acceptanceCriteria": [
        "The build version displayed in the BuildIdentityFooter is \"v56\".",
        "Any build version shown in deployment/diagnostics UI reflects \"56\" consistently for the same build."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/buildStamp.ts",
          "operation": "modify",
          "description": "Set the app’s build/version identity source to report Version 56 consistently (including default/fallback version behavior) so all UI consumers read \"56\" for this build."
        },
        {
          "path": "frontend/src/components/BuildIdentityFooter.tsx",
          "operation": "modify",
          "description": "Ensure the footer renders the build version exactly as \"v56\" (consistent formatting and no conflicting prefixes) based on the shared build info source. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/DeploymentDiagnosticsPanel.tsx",
          "operation": "modify",
          "description": "Ensure diagnostics UI displays Version 56 consistently wherever build/version is shown, using the shared build info source (no mismatched formatting between panels). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}