{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Quiz Editor: prevent unsaved question edits loss on focus/refetch + draft persistence",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Stop the Quiz Editor questions query from refetching on window/tab focus so in-progress edits are not overwritten.",
      "acceptanceCriteria": [
        "While editing a question (typing in text/answers) without saving, switching to a different tab/window and then returning does not clear or revert the typed inputs.",
        "This behavior is verified both for plain-text questions and questions that have a JPG attached.",
        "No new network fetch is triggered solely due to window/tab focus for the questions list used by the editor (unless explicitly refreshed by the user)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the React Query configuration for the editor’s questions list (useGetAllQuestions) to disable refetching solely due to window/tab focus (e.g., refetchOnWindowFocus: false) so focus changes cannot trigger a fetch that overwrites local edits."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Guard syncing localQuestions from server questions so background React Query updates never overwrite unsaved local edits; add explicit reload confirmation when unsaved changes exist.",
      "acceptanceCriteria": [
        "If the questions query updates while hasUnsavedChanges is true, the editor keeps the user’s local edits (text/answers/correct answer/image selection) intact.",
        "After the user presses Save (successful save), the editor state can safely sync to the latest server state again.",
        "An explicit user action to reload (e.g., existing refetch/refresh control if present) continues to work, and if triggered while unsaved changes exist, the UI must require a clear confirmation before discarding local edits."
      ],
      "file_operations": [
        {
          "path": "frontend/src/quiz/QuizEditor.tsx",
          "operation": "modify",
          "description": "Change the effect that currently does setLocalQuestions(questions) on every questions update to only sync when there are no unsaved changes (and/or when the user explicitly confirmed discarding edits). Add an explicit Reload/Refresh action that calls the existing refetch, but if hasUnsavedChanges is true, present a confirmation dialog before discarding local edits and applying the newly fetched server state."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Persist Quiz Editor in-progress question edits as a per-quiz draft in browser storage and restore it after reload/navigation with English resume/discard UI.",
      "acceptanceCriteria": [
        "While editing without saving, a page refresh (hard reload) restores the in-progress edits for that quizId from browser storage.",
        "Draft persistence includes question text, answers, correctAnswer, and any attached image ExternalBlob data needed by the editor to continue (or, if an image cannot be restored, the UI clearly indicates the image must be reattached without breaking other draft fields).",
        "After a successful Save, the stored draft for that quizId is cleared automatically.",
        "All user-facing prompts/buttons for draft recovery are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/quiz/draftStorage.ts",
          "operation": "create",
          "description": "Implement browser draft persistence utilities keyed by quizId (save/load/clear + lightweight server-version comparison). Include safe serialization for Question fields and best-effort image restoration using ExternalBlob direct URLs where possible (blob: URLs should be treated as non-restorable). Use the blob-storage ExternalBlob capability (ExternalBlob.getDirectURL / ExternalBlob.fromURL) for restorable images. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/quiz/QuizEditor.tsx",
          "operation": "modify",
          "description": "Wire draft persistence into the editor: (1) on localQuestions changes while unsaved, persist a draft (debounced) to browser storage keyed by quizId; (2) on mount, check for an existing draft and restore it; if the stored draft indicates the server version differs, show an English dialog offering Resume draft / Discard draft; (3) if an image cannot be restored, keep other fields and show clear English inline text indicating the image must be reattached; (4) on successful Save, clear the stored draft for that quizId."
        },
        {
          "path": "frontend/src/quiz/QuestionImagePicker.tsx",
          "operation": "modify",
          "description": "Adjust image-picker UX to support draft restore expectations: when the editor signals an image is missing/unrestorable after draft restore, show clear English guidance (without breaking existing fields). Keep using blob-storage ExternalBlob behavior for previews via getDirectURL when available. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}